RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_enet_regs.h
/*
 * RXIPV4NOPAYOIS (RW)
 *
 * MMC Receive IPV4 No Payload Octet Counter Interrupt Status
 * This bit is set when the rxipv4_nopay_octets counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXIPV4NOPAYOIS_MASK (0x40000UL)
#define ENET_MMC_IPC_INTR_RX_RXIPV4NOPAYOIS_SHIFT (18U)
#define ENET_MMC_IPC_INTR_RX_RXIPV4NOPAYOIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXIPV4NOPAYOIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXIPV4NOPAYOIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXIPV4NOPAYOIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXIPV4NOPAYOIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXIPV4NOPAYOIS_SHIFT)

/*
 * RXIPV4HEROIS (RW)
 *
 * MMC Receive IPV4 Header Error Octet Counter Interrupt Status
 * This bit is set when the rxipv4_hdrerr_octets counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXIPV4HEROIS_MASK (0x20000UL)
#define ENET_MMC_IPC_INTR_RX_RXIPV4HEROIS_SHIFT (17U)
#define ENET_MMC_IPC_INTR_RX_RXIPV4HEROIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXIPV4HEROIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXIPV4HEROIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXIPV4HEROIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXIPV4HEROIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXIPV4HEROIS_SHIFT)

/*
 * RXIPV4GOIS (RW)
 *
 * MMC Receive IPV4 Good Octet Counter Interrupt Status
 * This bit is set when the rxipv4_gd_octets counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXIPV4GOIS_MASK (0x10000UL)
#define ENET_MMC_IPC_INTR_RX_RXIPV4GOIS_SHIFT (16U)
#define ENET_MMC_IPC_INTR_RX_RXIPV4GOIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXIPV4GOIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXIPV4GOIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXIPV4GOIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXIPV4GOIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXIPV4GOIS_SHIFT)

/*
 * RXICMPERFIS (RW)
 *
 * MMC Receive ICMP Error Frame Counter Interrupt Status
 * This bit is set when the rxicmp_err_frms counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXICMPERFIS_MASK (0x2000U)
#define ENET_MMC_IPC_INTR_RX_RXICMPERFIS_SHIFT (13U)
#define ENET_MMC_IPC_INTR_RX_RXICMPERFIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXICMPERFIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXICMPERFIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXICMPERFIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXICMPERFIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXICMPERFIS_SHIFT)

/*
 * RXICMPGFIS (RW)
 *
 * MMC Receive ICMP Good Frame Counter Interrupt Status
 * This bit is set when the rxicmp_gd_frms counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXICMPGFIS_MASK (0x1000U)
#define ENET_MMC_IPC_INTR_RX_RXICMPGFIS_SHIFT (12U)
#define ENET_MMC_IPC_INTR_RX_RXICMPGFIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXICMPGFIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXICMPGFIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXICMPGFIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXICMPGFIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXICMPGFIS_SHIFT)

/*
 * RXTCPERFIS (RW)
 *
 * MMC Receive TCP Error Frame Counter Interrupt Status
 * This bit is set when the rxtcp_err_frms counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXTCPERFIS_MASK (0x800U)
#define ENET_MMC_IPC_INTR_RX_RXTCPERFIS_SHIFT (11U)
#define ENET_MMC_IPC_INTR_RX_RXTCPERFIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXTCPERFIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXTCPERFIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXTCPERFIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXTCPERFIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXTCPERFIS_SHIFT)

/*
 * RXTCPGFIS (RW)
 *
 * MMC Receive TCP Good Frame Counter Interrupt Status
 * This bit is set when the rxtcp_gd_frms counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXTCPGFIS_MASK (0x400U)
#define ENET_MMC_IPC_INTR_RX_RXTCPGFIS_SHIFT (10U)
#define ENET_MMC_IPC_INTR_RX_RXTCPGFIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXTCPGFIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXTCPGFIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXTCPGFIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXTCPGFIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXTCPGFIS_SHIFT)

/*
 * RXUDPERFIS (RW)
 *
 * MMC Receive UDP Error Frame Counter Interrupt Status
 * This bit is set when the rxudp_err_frms counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXUDPERFIS_MASK (0x200U)
#define ENET_MMC_IPC_INTR_RX_RXUDPERFIS_SHIFT (9U)
#define ENET_MMC_IPC_INTR_RX_RXUDPERFIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXUDPERFIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXUDPERFIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXUDPERFIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXUDPERFIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXUDPERFIS_SHIFT)

/*
 * RXUDPGFIS (RW)
 *
 * MMC Receive UDP Good Frame Counter Interrupt Status
 * This bit is set when the rxudp_gd_frms counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXUDPGFIS_MASK (0x100U)
#define ENET_MMC_IPC_INTR_RX_RXUDPGFIS_SHIFT (8U)
#define ENET_MMC_IPC_INTR_RX_RXUDPGFIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXUDPGFIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXUDPGFIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXUDPGFIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXUDPGFIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXUDPGFIS_SHIFT)

/*
 * RXIPV6NOPAYFIS (RW)
 *
 * MMC Receive IPV6 No Payload Frame Counter Interrupt Status
 * This bit is set when the rxipv6_nopay_frms counter reaches half of the maximum value or the maximum value.
 */
#define ENET_MMC_IPC_INTR_RX_RXIPV6NOPAYFIS_MASK (0x80U)
#define ENET_MMC_IPC_INTR_RX_RXIPV6NOPAYFIS_SHIFT (7U)
#define ENET_MMC_IPC_INTR_RX_RXIPV6NOPAYFIS_SET(x) (((uint32_t)(x) << ENET_MMC_IPC_INTR_RX_RXIPV6NOPAYFIS_SHIFT) & ENET_MMC_IPC_INTR_RX_RXIPV6NOPAYFIS_MASK)
#define ENET_MMC_IPC_INTR_RX_RXIPV6NOPAYFIS_GET(x) (((uint32_t)(x) & ENET_MMC_IPC_INTR_RX_RXIPV6NOPAYFIS_MASK) >> ENET_MMC_IPC_INTR_RX_RXIPV6NOPAYFIS_SHIFT)

