RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_enet_regs.h
/* Bitfield definition for register: DMA_STATUS */
/*
 * GLPII (RW)
 *
 * GLPII: GMAC LPI Interrupt (for Channel 0)
 * This bit indicates an interrupt event in the LPI logic of the MAC.
 * To reset this bit to 1'b0, the software must read the corresponding registers in the DWC_gmac to get the exact cause of the interrupt and clear its source.
 * Note: GLPII status is given only in Channel 0 DMA register and is applicable only when the Energy Efficient Ethernet feature is enabled. Otherwise, this bit is reserved.
 * When this bit is high, the interrupt signal from the MAC (sbd_intr_o) is high.
 * -or- GTMSI: GMAC TMS Interrupt (for Channel 1 and Channel 2) This bit indicates an interrupt event in the traffic manager and scheduler logic of DWC_gmac.
 * To reset this bit, the software must read the corresponding registers (Channel Status Register) to get the exact cause of the interrupt and clear its source.
 * Note: GTMSI status is given only in Channel 1 and Channel 2 DMA register when the AV feature is enabled and corresponding additional transmit channels are present.
 * Otherwise, this bit is reserved. When this bit is high, the interrupt signal from the MAC (sbd_intr_o) is high.
 */
#define ENET_DMA_STATUS_GLPII_MASK (0x40000000UL)
#define ENET_DMA_STATUS_GLPII_SHIFT (30U)
#define ENET_DMA_STATUS_GLPII_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_GLPII_SHIFT) & ENET_DMA_STATUS_GLPII_MASK)
#define ENET_DMA_STATUS_GLPII_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_GLPII_MASK) >> ENET_DMA_STATUS_GLPII_SHIFT)

/*
 * TTI (RW)
 *
 * Timestamp Trigger Interrupt
 * This bit indicates an interrupt event in the Timestamp Generator block of the DWC_gmac.
 * The software must read the corresponding registers in the DWC_gmac to get the exact cause of the interrupt and clear its source to reset this bit to 1'b0.
 *  When this bit is high, the interrupt signal from the DWC_gmac subsystem (sbd_intr_o) is high.
 * This bit is applicable only when the IEEE 1588 Timestamp feature is enabled. Otherwise, this bit is reserved.
 */
#define ENET_DMA_STATUS_TTI_MASK (0x20000000UL)
#define ENET_DMA_STATUS_TTI_SHIFT (29U)
#define ENET_DMA_STATUS_TTI_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_TTI_SHIFT) & ENET_DMA_STATUS_TTI_MASK)
#define ENET_DMA_STATUS_TTI_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_TTI_MASK) >> ENET_DMA_STATUS_TTI_SHIFT)

/*
 * GPI (RW)
 *
 * GMAC PMT Interrupt
 * This bit indicates an interrupt event in the PMT module of the DWC_gmac.
 *  The software must read the PMT Control and Status Register in the MAC to get the exact cause of interrupt and clear its source to reset this bit to 1’b0.
 * The interrupt signal from the DWC_gmac subsystem (sbd_intr_o) is high when this bit is high.
 * This bit is applicable only when the Power Management feature is enabled.
 * Otherwise, this bit is reserved. Note: The GPI and pmt_intr_o interrupts are generated in different clock domains.
 */
#define ENET_DMA_STATUS_GPI_MASK (0x10000000UL)
#define ENET_DMA_STATUS_GPI_SHIFT (28U)
#define ENET_DMA_STATUS_GPI_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_GPI_SHIFT) & ENET_DMA_STATUS_GPI_MASK)
#define ENET_DMA_STATUS_GPI_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_GPI_MASK) >> ENET_DMA_STATUS_GPI_SHIFT)

/*
 * GMI (RW)
 *
 * GMAC MMC Interrupt
 *  This bit reflects an interrupt event in the MMC module of the DWC_gmac.
 * The software must read the corresponding registers in the DWC_gmac
 * to get the exact cause of the interrupt and clear the source of interrupt to make this bit as 1’b0.
 * The interrupt signal from the DWC_gmac subsystem (sbd_intr_o) is high when this bit is high.
 * This bit is applicable only when the MAC Management Counters (MMC) are enabled. Otherwise, this bit is reserved.
 */
#define ENET_DMA_STATUS_GMI_MASK (0x8000000UL)
#define ENET_DMA_STATUS_GMI_SHIFT (27U)
#define ENET_DMA_STATUS_GMI_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_GMI_SHIFT) & ENET_DMA_STATUS_GMI_MASK)
#define ENET_DMA_STATUS_GMI_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_GMI_MASK) >> ENET_DMA_STATUS_GMI_SHIFT)

/*
 * GLI (RW)
 *
 * GMAC Line Interface Interrupt
 * When set, this bit reflects any of the following interrupt events in the DWC_gmac interfaces (if present and enabled in your configuration):
 * - PCS (TBI, RTBI, or SGMII): Link change or auto-negotiation complete event
 * - SMII or RGMII: Link change event - General Purpose Input Status (GPIS):
 *      Any LL or LH event on the gpi_i input ports To identify the exact cause of the interrupt,
 *     the software must first read Bit 11 and Bits[2:0] of Register 14 (Interrupt Status Register) and then to clear the source of interrupt (which also clears the GLI interrupt),
 *      read any of the following corresponding registers:
 * - PCS (TBI, RTBI, or SGMII): Register 49 (AN Status Register)
 * - SMII or RGMII: Register 54 (SGMII/RGMII/SMII Control and Status Register)
 * - General Purpose Input (GPI): Register 56 (General Purpose IO Register) The interrupt signal from the DWC_gmac subsystem (sbd_intr_o) is high when this bit is high.
 */
#define ENET_DMA_STATUS_GLI_MASK (0x4000000UL)
#define ENET_DMA_STATUS_GLI_SHIFT (26U)
#define ENET_DMA_STATUS_GLI_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_GLI_SHIFT) & ENET_DMA_STATUS_GLI_MASK)
#define ENET_DMA_STATUS_GLI_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_GLI_MASK) >> ENET_DMA_STATUS_GLI_SHIFT)

/*
 * EB (RW)
 *
 * Error Bits
 * This field indicates the type of error that caused a Bus Error, for example, error response on the AHB or AXI interface.
 *  This field is valid only when Bit 13 (FBI) is set. This field does not generate an interrupt.
 * - 0 0 0: Error during Rx DMA Write Data Transfer
 * - 0 1 1: Error during Tx DMA Read Data Transfer
 * - 1 0 0: Error during Rx DMA Descriptor Write Access
 * - 1 0 1: Error during Tx DMA Descriptor Write Access
 * - 1 1 0: Error during Rx DMA Descriptor Read Access
 * - 1 1 1: Error during Tx DMA Descriptor Read Access Note: 001 and 010 are reserved.
 */
#define ENET_DMA_STATUS_EB_MASK (0x3800000UL)
#define ENET_DMA_STATUS_EB_SHIFT (23U)
#define ENET_DMA_STATUS_EB_SET(x) (((uint32_t)(x) << ENET_DMA_STATUS_EB_SHIFT) & ENET_DMA_STATUS_EB_MASK)
#define ENET_DMA_STATUS_EB_GET(x) (((uint32_t)(x) & ENET_DMA_STATUS_EB_MASK) >> ENET_DMA_STATUS_EB_SHIFT)

