RT-Thread/rt-thread/bsp/hpmicro/libraries/hpm_sdk/soc/HPM6800/ip/hpm_enet_regs.h
/*
 * RTC (RW)
 *
 * Receive Threshold Control
 * These two bits control the threshold level of the MTL Receive FIFO.
 * Transfer (request) to DMA starts when the frame size within the MTL Receive FIFO is larger than the threshold.
 * In addition, full frames with length less than the threshold are automatically transferred.
 * The value of 11 is not applicable if the configured Receive FIFO size is 128 bytes.
 * These bits are valid only when the RSF bit is zero, and are ignored when the RSF bit is set to 1.
 * - 00: 64
 * - 01: 32
 * - 10: 96
 * - 11: 128
 */
#define ENET_DMA_OP_MODE_RTC_MASK (0x18U)
#define ENET_DMA_OP_MODE_RTC_SHIFT (3U)
#define ENET_DMA_OP_MODE_RTC_SET(x) (((uint32_t)(x) << ENET_DMA_OP_MODE_RTC_SHIFT) & ENET_DMA_OP_MODE_RTC_MASK)
#define ENET_DMA_OP_MODE_RTC_GET(x) (((uint32_t)(x) & ENET_DMA_OP_MODE_RTC_MASK) >> ENET_DMA_OP_MODE_RTC_SHIFT)

/*
 * OSF (RW)
 *
 * Operate on Second Frame
 * When this bit is set, it instructs the DMA to process the second frame of the Transmit data even before the status for the first frame is obtained.
 */
#define ENET_DMA_OP_MODE_OSF_MASK (0x4U)
#define ENET_DMA_OP_MODE_OSF_SHIFT (2U)
#define ENET_DMA_OP_MODE_OSF_SET(x) (((uint32_t)(x) << ENET_DMA_OP_MODE_OSF_SHIFT) & ENET_DMA_OP_MODE_OSF_MASK)
#define ENET_DMA_OP_MODE_OSF_GET(x) (((uint32_t)(x) & ENET_DMA_OP_MODE_OSF_MASK) >> ENET_DMA_OP_MODE_OSF_SHIFT)

/*
 * SR (RW)
 *
 * Start or Stop Receive
 * When this bit is set, the Receive process is placed in the Running state.
 * The DMA attempts to acquire the descriptor from the Receive list and processes the incoming frames.
 * The descriptor acquisition is attempted from the current position in the list,
 * which is the address set by the Register 3 (Receive Descriptor List Address Register) or the position retained when the Receive process was previously stopped.
 * If the DMA does not own the descriptor, reception is suspended and Bit 7 (Receive Buffer Unavailable) of Register 5 (Status Register) is set.
 * The Start Receive command is effective only when the reception has stopped.
 *  If the command is issued before setting Register 3 (Receive Descriptor List Address Register), the DMA behavior is unpredictable.
 * When this bit is cleared, the Rx DMA operation is stopped after the transfer of the current frame.
 * The next descriptor position in the Receive list is saved and becomes the current position after the Receive process is restarted.
 * The Stop Receive command is effective only when the Receive process is in either the Running (waiting for receive packet) or in the Suspended state.
 */
#define ENET_DMA_OP_MODE_SR_MASK (0x2U)
#define ENET_DMA_OP_MODE_SR_SHIFT (1U)
#define ENET_DMA_OP_MODE_SR_SET(x) (((uint32_t)(x) << ENET_DMA_OP_MODE_SR_SHIFT) & ENET_DMA_OP_MODE_SR_MASK)
#define ENET_DMA_OP_MODE_SR_GET(x) (((uint32_t)(x) & ENET_DMA_OP_MODE_SR_MASK) >> ENET_DMA_OP_MODE_SR_SHIFT)

/* Bitfield definition for register: DMA_INTR_EN */
/*
 * NIE (RW)
 *
 * Normal Interrupt Summary Enable
 * When this bit is set, normal interrupt summary is enabled.
 * When this bit is reset, normal interrupt summary is disabled.
 * This bit enables the following interrupts in Register 5 (Status Register):
 *  - Register 5[0]: Transmit Interrupt
 * - Register 5[2]: Transmit Buffer Unavailable
 * - Register 5[6]: Receive Interrupt
 *  - Register 5[14]: Early Receive Interrupt
 */
#define ENET_DMA_INTR_EN_NIE_MASK (0x10000UL)
#define ENET_DMA_INTR_EN_NIE_SHIFT (16U)
#define ENET_DMA_INTR_EN_NIE_SET(x) (((uint32_t)(x) << ENET_DMA_INTR_EN_NIE_SHIFT) & ENET_DMA_INTR_EN_NIE_MASK)
#define ENET_DMA_INTR_EN_NIE_GET(x) (((uint32_t)(x) & ENET_DMA_INTR_EN_NIE_MASK) >> ENET_DMA_INTR_EN_NIE_SHIFT)

/*
 * AIE (RW)
 *
 * Abnormal Interrupt Summary Enable
 * When this bit is set, abnormal interrupt summary is enabled.
 * When this bit is reset, the abnormal interrupt summary is disabled.
 * This bit enables the following interrupts in Register 5 (Status Register):
 * - Register 5[1]: Transmit Process Stopped
 * - Register 5[3]: Transmit Jabber Timeout
 * - Register 5[4]: Receive Overflow
 * - Register 5[5]: Transmit Underflow
 * - Register 5[7]: Receive Buffer Unavailable
 * - Register 5[8]: Receive Process Stopped
 * - Register 5[9]: Receive Watchdog Timeout
 * - Register 5[10]: Early Transmit Interrupt
 *  - Register 5[13]: Fatal Bus Error
 */
#define ENET_DMA_INTR_EN_AIE_MASK (0x8000U)
#define ENET_DMA_INTR_EN_AIE_SHIFT (15U)
#define ENET_DMA_INTR_EN_AIE_SET(x) (((uint32_t)(x) << ENET_DMA_INTR_EN_AIE_SHIFT) & ENET_DMA_INTR_EN_AIE_MASK)
#define ENET_DMA_INTR_EN_AIE_GET(x) (((uint32_t)(x) & ENET_DMA_INTR_EN_AIE_MASK) >> ENET_DMA_INTR_EN_AIE_SHIFT)

/*
 * ERE (RW)
 *
 * Early Receive Interrupt Enable
 * When this bit is set with Normal Interrupt Summary Enable (Bit 16), the Early Receive Interrupt is enabled. When this bit is reset, the Early Receive Interrupt is disabled.
 */
#define ENET_DMA_INTR_EN_ERE_MASK (0x4000U)
#define ENET_DMA_INTR_EN_ERE_SHIFT (14U)
#define ENET_DMA_INTR_EN_ERE_SET(x) (((uint32_t)(x) << ENET_DMA_INTR_EN_ERE_SHIFT) & ENET_DMA_INTR_EN_ERE_MASK)
#define ENET_DMA_INTR_EN_ERE_GET(x) (((uint32_t)(x) & ENET_DMA_INTR_EN_ERE_MASK) >> ENET_DMA_INTR_EN_ERE_SHIFT)

/*
 * FBE (RW)
 *
 * Fatal Bus Error Enable
 * When this bit is set with Abnormal Interrupt Summary Enable (Bit 15), the Fatal Bus Error Interrupt is enabled. When this bit is reset, the Fatal Bus Error Enable Interrupt is disabled.
 */
#define ENET_DMA_INTR_EN_FBE_MASK (0x2000U)
#define ENET_DMA_INTR_EN_FBE_SHIFT (13U)
#define ENET_DMA_INTR_EN_FBE_SET(x) (((uint32_t)(x) << ENET_DMA_INTR_EN_FBE_SHIFT) & ENET_DMA_INTR_EN_FBE_MASK)
#define ENET_DMA_INTR_EN_FBE_GET(x) (((uint32_t)(x) & ENET_DMA_INTR_EN_FBE_MASK) >> ENET_DMA_INTR_EN_FBE_SHIFT)

/*
 * ETE (RW)
 *
 * Early Transmit Interrupt Enable
 * When this bit is set with an Abnormal Interrupt Summary Enable (Bit 15), the Early Transmit Interrupt is enabled. When this bit is reset, the Early Transmit Interrupt is disabled.
 */
#define ENET_DMA_INTR_EN_ETE_MASK (0x400U)
#define ENET_DMA_INTR_EN_ETE_SHIFT (10U)
#define ENET_DMA_INTR_EN_ETE_SET(x) (((uint32_t)(x) << ENET_DMA_INTR_EN_ETE_SHIFT) & ENET_DMA_INTR_EN_ETE_MASK)
#define ENET_DMA_INTR_EN_ETE_GET(x) (((uint32_t)(x) & ENET_DMA_INTR_EN_ETE_MASK) >> ENET_DMA_INTR_EN_ETE_SHIFT)

